package days12;

/**
 * @author JUNYONG
 * @Date 2024. 7. 16.=오전 11:16:01
 * @subject class
 * @content
 *
 */
public class Ex02 {

	public static void main(String[] args) {
		//객체지향적 프로그래밍  OOP

		
		// 클래스 = 객체의 설계도, 객체: 설계도 보고 만든거
		//객체 : 속상 + 동작(기능) , 클래스로 실제 존재하는 것
		//인스턴스 생성된 객체
		//인스턴스화: 클래스(설계도) -> 객체(집)을 생성하는 과정
		
		//클래스 설계 과정
		//객체의 구성 요소 (속성, 기능) 파악 - 목록 작성
		//클래스 선언
		//객체 생성
		//테스트
		//문제점 발생 - 유지, 보수
		//상용화 - 배포
		//버전 관리 -기능 추가 ,보수(보안 포함)
		
		//OOP특징
		//캡슐화
		//상속
		//다형성
		//은닉화
		//추상화
		
		//객체 (클래스)간의 관계
		//집합관계 has-a
		//사용 관계 X
		//상속 관계 is-a
		
		//예) 망치
		//		설계도 필요 == 클래스 필요
		//		기능 : 못, 빼기 등
		//		속성(특징) 고무... 나무... 크기 등등
		
		//클래스 선언 형식
		// [접근지정자] [기타제어자] class 클래스명 [extends Super클래스] [implements 인터페이스]
		
		// 클래스 구성 요소(==멤버)
		// 속성 == 특징 == property 멤버 변수 (필드)
		// 기능 == 동작(일) ==function 멤버 함수 (메서드)
		
		
		
	}//main

}//class
